In [1]:
# Import required libraries
import pandas as pd
import numpy as np

In [2]:
# Check the version
pd.__version__

'0.24.2'

In [3]:
# Create an Empty Series
s = pd.Series(dtype = float)
print(s)

Series([], dtype: float64)

In [4]:
# Create a Series from ndarray
s = np.arange(6,9)
pd.Series(s)

0    6
1    7
2    8
dtype: int32

In [5]:
# Create a Series from dict
s = {'a' : 0., 'b' : 1., 'c' : 2.}
pd.Series(s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [6]:
# Create a Series from Scalar
pd.Series(123, index=[0, 1, 2, 3])

0    123
1    123
2    123
3    123
dtype: int64

In [7]:
# Create an Empty DataFrame
df = pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

In [8]:
# Create a DataFrame from Lists
data = [['Program','CQF'],['Module', 1],['School', 'Fitch'], ['City', 'London'], ['Country', 'UK']]
df = pd.DataFrame(data, columns=['Name', 'Details'])
df

      Name Details
0  Program     CQF
1   Module       1
2   School   Fitch
3     City  London
4  Country      UK

In [9]:
# Create a DataFrame from Dictionary
data = {'Name': ['Program', 'Module', 'School', 'City', 'Country'],
           'Details': ['CQF', 1, 'Fitch', 'London', 'UK']}
df = pd.DataFrame(data)
df

      Name Details
0  Program     CQF
1   Module       1
2   School   Fitch
3     City  London
4  Country      UK

In [10]:
# Create a DataFrame from Series
data = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
        'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [11]:
# Create a DataFrame from NumPy arrays
data = np.ones((3,4))
df = pd.DataFrame(data)
df

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0

In [12]:
# Selection from Series
s = pd.Series(np.arange(10,20))
print(s)
print(f'First Element in a Series: {s[0]}')  # first element
print(f'First Element in a Series: {s[:3]}')  # first three elements

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32
First Element in a Series: 10
First Element in a Series: 0    10
1    11
2    12
dtype: int32

In [13]:
s.loc[1]

11

In [14]:
# Selection from Series as dictionary
s = pd.Series({'a' : 0., 'b' : 1., 'c' : 2.})
s['a'], s['c']

(0.0, 2.0)

In [15]:
# Column selection from DataFrame o
data = {'Name': ['Program', 'Module', 'School', 'City', 'Country'],
           'Details': ['CQF', 1, 'Fitch', 'London', 'UK']}

df = pd.DataFrame(data,  index = ['a','b','c','d','e'])
print(df)
df['Name']

      Name Details
a  Program     CQF
b   Module       1
c   School   Fitch
d     City  London
e  Country      UK

a    Program
b     Module
c     School
d       City
e    Country
Name: Name, dtype: object

In [16]:
df.loc['d']

Name         City
Details    London
Name: d, dtype: object

In [17]:
df.iloc[2]

Name       School
Details     Fitch
Name: c, dtype: object

In [18]:
df.iloc[0:2]

      Name Details
a  Program     CQF
b   Module       1

In [19]:
df = pd.DataFrame(np.arange(1,21), columns=['Numeric'])

In [20]:
# First five values
df.head()

   Numeric
0        1
1        2
2        3
3        4
4        5

In [21]:
# Last five values
df.tail()

    Numeric
15       16
16       17
17       18
18       19
19       20

In [22]:
# DataFrame index object
df.index

RangeIndex(start=0, stop=20, step=1)

In [23]:
# Metadata
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 1 columns):
Numeric    20 non-null int32
dtypes: int32(1)
memory usage: 160.0 bytes

In [24]:
# Tuple representing the dimension of the DataFrame
df.shape

(20, 1)

In [25]:
# NumPy representation of NDFrame
df.values

array([[ 1],
       [ 2],
       [ 3],
       [ 4],
       [ 5],
       [ 6],
       [ 7],
       [ 8],
       [ 9],
       [10],
       [11],
       [12],
       [13],
       [14],
       [15],
       [16],
       [17],
       [18],
       [19],
       [20]])

In [26]:
# Sum
print(f'Sum                : {df.sum()[0]}')
print(f'Mean               : {df.mean()[0]}')
print(f'Median             : {df.median()[0]}')
print(f'Standard deviation : {df.std()[0]:.2f}')
print(f'Minimum            : {df.min()[0]}')
print(f'Maximum            : {df.max()[0]}')
print(f'Index of Minimum   : {df.idxmin()[0]}')
print(f'Index of Maximum   : {df.idxmax()[0]}')

Sum                : 210
Mean               : 10.5
Median             : 10.5
Standard deviation : 5.92
Minimum            : 1
Maximum            : 20
Index of Minimum   : 0
Index of Maximum   : 19

In [27]:
# Cumulative Sum
print(df)
print(df.cumsum())
print(df.cumsum().iloc[-1])

    Numeric
0         1
1         2
2         3
3         4
4         5
5         6
6         7
7         8
8         9
9        10
10       11
11       12
12       13
13       14
14       15
15       16
16       17
17       18
18       19
19       20
    Numeric
0         1
1         3
2         6
3        10
4        15
5        21
6        28
7        36
8        45
9        55
10       66
11       78
12       91
13      105
14      120
15      136
16      153
17      171
18      190
19      210
Numeric    210
Name: 19, dtype: int32

In [28]:
# Cumulative Product
df.cumprod().iloc[-1]

Numeric   -2102132736
Name: 19, dtype: int32

In [29]:
# Summary Statistics 
df.describe().T

         count  mean      std  min   25%   50%    75%   max
Numeric   20.0  10.5  5.91608  1.0  5.75  10.5  15.25  20.0

In [30]:
df.sum()

Numeric    210
dtype: int64

In [31]:
df.mean()

Numeric    10.5
dtype: float64

In [33]:
df.mad()

Numeric    5.0
dtype: float64

In [36]:
# Sort by Index
s = pd.Series(np.arange(1,6), index=['e', 'a', 'c', 'b', 'd'])
print(s)
print(s.sort_index())

e    1
a    2
c    3
b    4
d    5
dtype: int32
a    2
b    4
c    3
d    5
e    1
dtype: int32

In [37]:
# Sort by values
s.sort_values()

e    1
a    2
c    3
b    4
d    5
dtype: int32

In [38]:
np.random.seed(0)
df = pd.DataFrame(np.arange(10).reshape(2,5), index=['two', 'one'], columns=['d', 'e', 'a', 'c', 'b'])
df

     d  e  a  c  b
two  0  1  2  3  4
one  5  6  7  8  9

In [39]:
# Sort DataFrame by index
df.sort_index(axis=1, ascending=False)

     e  d  c  b  a
two  1  0  3  4  2
one  6  5  8  9  7

In [43]:
# Sort DataFrame by index
df.sort_index(axis=0)

     d  e  a  c  b
one  5  6  7  8  9
two  0  1  2  3  4

In [40]:
dd = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
dd

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4

In [41]:
# Sort DataFrame by values
dd.sort_values( by=['col1', 'col2'])

   col1  col2
2     1     2
1     1     3
3     1     4
0     2     1

In [47]:
data = pd.read_csv('spy.csv', index_col=0, parse_dates=True)
data.head()

                 Open       High         Low     Close   Adj Close    Volume
Date
1999-12-31  146.84375  147.50000  146.250000  146.8750  100.376900   3172700
2000-01-03  148.25000  148.25000  143.875000  145.4375   99.394493   8164300
2000-01-04  143.53125  144.06250  139.640625  139.7500   95.507530   8089800
2000-01-05  139.93750  141.53125  137.250000  140.0000   95.678391  12177900
2000-01-06  139.62500  141.50000  137.750000  137.7500   94.140717   6227200

In [48]:
data[['Volume']].groupby(data.index.year).sum().head()

           Volume
Date
1999      3172700
2000   1931577800
2001   3420728000
2002   8516467700
2003  10303214100

In [50]:
data.index.year

Int64Index([1999, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000, 2000,
            ...
            2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020],
           dtype='int64', name='Date', length=5114)

In [54]:
data.groupby(data.index.year).sum().head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
1999,146.843750,147.500000,146.250000,146.875000,100.376900,3172700
2000,36071.187500,36380.750000,35696.171875,36023.859375,24721.091171,1931577800
2001,29699.775635,29960.145607,29415.693764,29700.633141,20606.366402,3420728000
2002,25159.760002,25406.529968,24889.209976,25143.649940,17677.005070,8516467700
2003,24413.080002,24590.909973,24236.430023,24430.370018,17474.746273,10303214100

In [55]:
pd.pivot_table(data=data, index = data.index.year, values='Volume', aggfunc=sum).head()

           Volume
Date
1999      3172700
2000   1931577800
2001   3420728000
2002   8516467700
2003  10303214100

In [56]:
pd.pivot_table(data=data, index = [data.index.year, data.index.month], values='Volume', aggfunc=sum).head(13)

              Volume
Date Date
1999 12      3172700
2000 1     156770800
     2     186938300
     3     247594900
     4     229246200
     5     161024000
     6     127146000
     7     106780100
     8     102365500
     9     113203000
     10    178392400
     11    156699900
     12    165416700

In [59]:
data[['Volume']].groupby(data.index.month).sum().head()

           Volume
Date
1     47437604100
2     45157103900
3     56661031100
4     44003242400
5     45106509500

In [61]:
# Filter dates on which close price above 300
data[data['Close']>300]['Close'].head()

Date
2019-07-12    300.649994
2019-07-15    300.750000
2019-07-23    300.029999
2019-07-24    301.440002
2019-07-26    302.010010
Name: Close, dtype: float64

In [62]:
data[data['Close']>300].head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2019-07-12,299.850006,300.730011,299.510010,300.649994,296.062897,40326000
2019-07-15,301.130005,301.130005,300.190002,300.750000,296.161377,33900000
2019-07-23,299.140015,300.029999,298.220001,300.029999,295.452362,44564500
2019-07-24,299.190002,301.440002,299.089996,301.440002,296.840851,47213200
2019-07-26,300.760010,302.230011,300.619995,302.010010,297.402130,45084100

In [63]:
# Filter Open = High
data[data['Open']== data['High']].count()

Open         37
High         37
Low          37
Close        37
Adj Close    37
Volume       37
dtype: int64

In [65]:
# Filter Open = High
data[data['Open']== data['High']].head()

                 Open       High         Low      Close  Adj Close   Volume
Date
2000-01-03  148.25000  148.25000  143.875000  145.43750  99.394493  8164300
2000-01-12  144.59375  144.59375  142.875000  143.06250  97.771339  6907700
2000-01-20  146.96875  146.96875  143.812500  144.75000  98.924614  5800100
2000-01-21  145.50000  145.50000  144.062500  144.43750  98.711052  6244800
2000-02-09  144.46875  144.46875  141.265625  141.28125  96.554039  8511500

In [68]:
df1 = data.copy()
print(df1.head())

                 Open       High         Low     Close   Adj Close    Volume
Date
1999-12-31  146.84375  147.50000  146.250000  146.8750  100.376900   3172700
2000-01-03  148.25000  148.25000  143.875000  145.4375   99.394493   8164300
2000-01-04  143.53125  144.06250  139.640625  139.7500   95.507530   8089800
2000-01-05  139.93750  141.53125  137.250000  140.0000   95.678391  12177900
2000-01-06  139.62500  141.50000  137.750000  137.7500   94.140717   6227200

In [70]:
df1.loc[df1['Open'] == df1['High'], 'O=H'] = -1
df1.loc[df1['Open'] == df1['Low'], 'O=L'] = 1
df1.fillna(0,inplace=True)

In [71]:
df1.head()

,Open,High,Low,Close,Adj Close,Volume,O=H,O=L
Date,,,,,,,,
1999-12-31,146.84375,147.50000,146.250000,146.8750,100.376900,3172700,0.0,0.0
2000-01-03,148.25000,148.25000,143.875000,145.4375,99.394493,8164300,-1.0,0.0
2000-01-04,143.53125,144.06250,139.640625,139.7500,95.507530,8089800,0.0,0.0
2000-01-05,139.93750,141.53125,137.250000,140.0000,95.678391,12177900,0.0,0.0
2000-01-06,139.62500,141.50000,137.750000,137.7500,94.140717,6227200,0.0,0.0

In [72]:
# Add new column 
df1['CHG'] = 100*(df1['Close'].sub(df1['Open']))/df1['Open']

In [74]:
print(df1.head())

                 Open       High         Low     Close   Adj Close    Volume  \
Date
1999-12-31  146.84375  147.50000  146.250000  146.8750  100.376900   3172700
2000-01-03  148.25000  148.25000  143.875000  145.4375   99.394493   8164300
2000-01-04  143.53125  144.06250  139.640625  139.7500   95.507530   8089800
2000-01-05  139.93750  141.53125  137.250000  140.0000   95.678391  12177900
2000-01-06  139.62500  141.50000  137.750000  137.7500   94.140717   6227200

            O=H  O=L       CHG
Date
1999-12-31  0.0  0.0  0.021281
2000-01-03 -1.0  0.0 -1.897133
2000-01-04  0.0  0.0 -2.634444
2000-01-05  0.0  0.0  0.044663
2000-01-06  0.0  0.0 -1.342883

In [75]:
# Reading a csv file
data = pd.read_csv('spy.csv', index_col=0, parse_dates=True)
data.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2020-04-23,280.489990,283.940002,278.750000,279.079987,279.079987,104709700
2020-04-24,280.730011,283.700012,278.500000,282.970001,282.970001,85166000
2020-04-27,285.119995,288.269989,284.619995,287.049988,287.049988,77896600
2020-04-28,291.019989,291.399994,285.399994,285.730011,285.730011,105270000
2020-04-29,291.529999,294.880005,290.410004,293.209991,293.209991,118745600